<template>
  <section class="container m-auto max-w-4xl w-4xl">
    <Header/>
    <!--MainNavigator class="my-24"/-->
    <section class="w-3/4 mx-auto my-20">
      <h1 class="text-center text-orange-600 uppercase">о нас</h1>
      <div class="text-xs text-justify text-gray-600">
        <p class="my-2 leading-5">
          Компания ПРОКОРМ занимается кормлением животных с 2013 года, все это время наш главный принцип очень прост и надежен - наши продукты должны приносить ПРИБЫЛЬ нашим клиентам. Для этого мы придерживаемся двух критериев работы - выбор наилучшего сырья и понимание процесса составления сбалансированных рационов для любых продуктивных животных, на определенных этапах их выращивания.
        </p>
        <p class="my-2 leading-5">
          Используя наши продукты в рационах для ваших животных, вы можете быть уверены в их составе и качестве. Наши специалисты всегда готовы проконсультировать вас и оказать помощь по подбору необходимых продуктов для вашего хозяйства, в случае необходимости - приехать к вам хозяйство, дать рекомендации и составить рационы. Постоянное взаимодействие с лучшими хозяйствами Европы и России, позволяет нам развиваться и мы готовы передать вам успешный опыт этих хозяйств.
        </p>

      </div>
    </section>

    <section class="w-3/4 mx-auto my-20">
      <h1 class="text-center text-orange-600 uppercase">что мы делаем</h1>
      <div class="text-xs text-justify text-gray-600">
        <p class="my-2 leading-5">
          Наше производство расположено в деревне Васильчиково Гороховецкого района Владимирской области. Производство представляет собой современный компактный завод, расположенный на площади 1000 м2. Завод оснащен самым современным оборудованием: горизонтальные двухвальные смесители, молотковые измельчители, колонны охлаждения, два экструдера, общей мощностью более 100 кВт и прочее вспомогательное оборудование. Фасовка и упаковка товара осуществляется полностью в автоматическом режиме.
        </p>
        <p class="my-2 leading-5">
          На данный момент компания ПРОКОРМ является производителем премиксов, комбикормов, БМВК и лизунцов для любых продуктивных животных. Нашей гордостью является комплексный подход к составлению рецептуры продукта, будь то кормовая добавка или полноценный корм - главным принципом является обеспечить организм животного необходимым набором элементов на конкретном этапе его жизни.
        </p>
      </div>
    </section>

    <section class="w-3/4 mx-auto my-20">
      <h1 class="text-center text-orange-600 uppercase">эффективность</h1>
      <div class="text-xs text-justify text-gray-600">
        <p class="my-2 leading-5">
          Эффективность, с нашей точки зрения, это баланс между ценой и результатом, поэтому мы стараемся разделять наши продукты по фазам жизни продуктивных животных. Например, то что нужно несушке - не актуально для бройлера, или, то без чего не может обойтись сухостойная корова – не играет ни какой роли в период лактации. Каждый продукт четко для своего места, ничего лишнего, и в тоже время все самое необходимое.
        </p>
      </div>
    </section>

    <section class="w-3/4 mx-auto my-20">
      <h1 class="text-center text-orange-600 uppercase">из чего это сделано</h1>
      <div class="text-xs text-justify text-gray-600">
        <p class="my-2 leading-5">
          Для производства своих комбикормов мы не используем зерноотходы, либо другие "непонятные" компоненты. На любой нашей упаковке вы найдете полное описание состава и основных параметров продукта, таких как Сырой протеин, Обменная энергия и другие. Зерновые, входящие в комбикорм, проходят процесс экструдирования, что позволяет увеличить процент усвоения корма и улучшить вкусовые показатели. Мы понимаем как важна витаминно-минеральная часть продукта, поэтому во все без исключения, наши продукты мы вводим премиксы собственного производства.
        </p>
        <p class="my-2 leading-5">
          Премиксы, которые мы производим, отвечают самым высоким стандартам качества. Как известно, премикс состоит из макроэлементов, микроэлементов и витаминов. Мы уделяем особое внимание каждому компоненту, входящему в состав премиксов. Например, все макроэлементы, используемые нами в производстве премиксов, имеют структуру микрогранулятов или крупок – сделано это нами осознано, с целью того, чтобы конечный продукт не пылил, а следовательно не вызывал аллергических реакций у людей, непосредственно контактирующих с премиксом. Микроэлементы, в форме глицин-хелатов, а так же витамины, которые мы используем для производства премиксов, поступают к нам с заводов, расположенных в Европе.
        </p>
        <p class="my-2 leading-5">
          В высоком качестве наших продуктов вы сможете убедиться сразу после начала работы с нами. Более подробную информацию вы можете посмотреть на нашем сайте или обратиться к нам по телефону или электронной почте, указанным в разделе «Контакты».
        </p>
      </div>
    </section>

    <Footer/>
  </section>
</template>

<script lang="ts">

import Vue from 'vue'
import { Route } from 'vue-router'
import Header from '../components/Header.vue'
import MainNavigator from '../components/MainNavigator.vue'

export default Vue.extend({})
</script>

<style lang="scss">
.container {
}
</style>
