import {STAGE, CATEGORY, PACKING, ANIMAL} from '@/models/enums'
import {IProduct} from '@/models/interfaces'

export default [
{
  code: '259193',
  name: 'Pescary',
  type: 'Trout Start 55/13',
  category: CATEGORY.FEED,
  packing: PACKING.BAG,
  weight: '25 кг',
  stages: [STAGE.START],
  animals: [ANIMAL.FISH],
  shortDescription: 'Для выращивания личинок форели с момента перехода на экзогенное питание',
  fullDescription: `Корм предназначен для выращивания личинок форели с момента перехода на экзогенное
  питание (рассасывание желточного мешка на 50- 60%) до достижения молодью массы 3 г.
  Характеризуется оптимальным балансом протеина, жира и переваримой энергии,
  соответствующим физиологической потребности в раннем онтогенезе. Источником
  легкоусвояемого протеина служит рыбная мука низкотемпературной сушки, наилучшим
  образом удовлетворяющая требованиям молоди к качеству белков, пептидов,
  аминокислот, витаминов и других биологически активных веществ.`,
  //gost: 'ГОСТ 26573.0-2017',
  dosing: [],
  enhancements: [],
  indicators: [],
  composition: `Рыбная мука, концентрат белка
  подсолнечника, кукурузный глютен, рыбий жир, порошковый гемоглобин, премикс,
  аминокислоты.`,
}, {
  code: '342973',
  name: 'Pescary',
  type: 'Trout Yearlings 50/17',
  category: CATEGORY.FEED,
  packing: PACKING.BAG,
  weight: '25 кг',
  stages: [STAGE.START],
  animals: [ANIMAL.FISH],
  shortDescription: 'Для кормления молоди форели',
  fullDescription: `Корм предназначен для кормления молоди форели и гарантирует плавный переход от
  специализированных стартовых кормов к продукционным кормам. Эффективное
  соотношение аминокислотного состава корма и переваримой энергии является основой
  для высокой скорости роста рыбы и хороших показателей использования корма.`,
  //gost: 'ГОСТ 26573.0-2017',
  dosing: [],
  enhancements: [],
  indicators: [],
  composition: `Рыбная мука, пшеница,
  концентрат белка подсолнечника, кукурузный глютен, рыбий жир, порошковый
  гемоглобин, премикс, аминокислоты.`,
}, {
  code: '182449',
  name: 'Pescary',
  type: 'Trout Growth 43/15',
  category: CATEGORY.FEED,
  packing: PACKING.BAG,
  weight: '25 кг',
  stages: [STAGE.FATTEING],
  animals: [ANIMAL.FISH],
  shortDescription: 'Для товарного выращивания форели.',
  fullDescription: `Эффективный, сбалансированный корм с пониженным уровнем сырого жира для
  товарного выращивания форели. Характеризуется оптимальным соотношением уровня
  всех незаменимых аминокислот и перевариваемой энергии. Аминокислотный профиль
  кормов адаптирован к навеске рыбы и плавно изменяется согласно увеличению размеров
  гранул корма. Рекомендуется для использования в условиях повышенных температур
  воды (в условиях отклонения от нормы или в целях снижения затрат на корма).`,
  //gost: 'ГОСТ 26573.0-2017',
  dosing: [],
  enhancements: [],
  indicators: [],
  composition: `Рыбная мука, пшеница, концентрат
  белка подсолнечника, кукурузный глютен, шрот соевый, шрот подсолнечный, рыбий жир,
  соевое масло, порошковый гемоглобин, дрожжи кормовые, премикс, аминокислоты.`,
}, {
  code: '421366',
  name: 'Pescary',
  type: 'Trout Growth 43/20',
  category: CATEGORY.FEED,
  packing: PACKING.BAG,
  weight: '25 кг',
  stages: [STAGE.FATTEING],
  animals: [ANIMAL.FISH],
  shortDescription: 'Для товарного выращивания форели.',
  fullDescription: `Среднеэнергетический корм для товарного выращивания форели. Оптимальное
  соотношение всего ряда незаменимых аминокислот к уровню перевариваемой энергии
  обеспечивает высокий темп роста форели и пониженный кормовой коэффициент.
  Рекомендуется для использования в нормальных условиях выращивания.`,
  //gost: 'ГОСТ 26573.0-2017',
  dosing: [],
  enhancements: [],
  indicators: [],
  composition: `Рыбная мука, пшеница, концентрат
  белка подсолнечника, кукурузный глютен, шрот соевый, шрот подсолнечный, рыбий жир,
  соевое масло, порошковый гемоглобин, дрожжи кормовые, премикс, аминокислоты.`,
}, {
  code: '894586',
  name: 'Pescary',
  type: 'Trout Growth 43/25',
  category: CATEGORY.FEED,
  packing: PACKING.BAG,
  weight: '25 кг',
  stages: [STAGE.FATTEING],
  animals: [ANIMAL.FISH],
  shortDescription: 'Для товарного выращивания форели.',
  fullDescription: `Высокоэффективный корм с повышенным содержанием сырого жира для товарного
  выращивания форели. Характеризуется максимальным уровнем перевариваемой энергии.
  Позволяет получить самые низкие значения кормового коэффициента среди
  представленных продукционных кормов.
  Рекомендуется для использования в нормальных и оптимальных условиях выращивания.`,
  //gost: 'ГОСТ 26573.0-2017',
  dosing: [],
  enhancements: [],
  indicators: [],
  composition: `Рыбная мука, пшеница, концентрат
  белка подсолнечника, кукурузный глютен, соевый концентрат, рыбий жир, соевое масло,
  порошковый гемоглобин, премикс, аминокислоты.`,
}, {
  code: '804586',
  name: 'Pescary',
  type: 'Trout Spawning 48/10',
  category: CATEGORY.FEED,
  packing: PACKING.BAG,
  weight: '25 кг',
  stages: [STAGE.SPAWNING],
  animals: [ANIMAL.FISH],
  shortDescription: 'Для кормления форели в период нереста.',
  fullDescription: `Корм предназначен для кормления форели в период нереста. Характеризуется
  оптимальным балансом протеина, жира и переваримой энергии.`,
  //gost: 'ГОСТ 26573.0-2017',
  dosing: [],
  enhancements: [],
  indicators: [],
  composition: `Рыбная мука, пшеница,
  концентрат белка подсолнечника, кукурузный глютен, шрот соевый, рыбий жир, соевое
  масло, порошковый гемоглобин, премикс, аминокислоты.`,
}] as IProduct[]
