import {STAGE, CATEGORY, PACKING, ANIMAL} from '@/models/enums'
import {IProduct} from '@/models/interfaces'

export default [
  {
    code: '015684',
    name: 'UCCELLY',
    type: 'Goose Start',
    category: CATEGORY.FEED,
    packing: PACKING.BAG,
    weight: '25 кг',
    stages: [STAGE.START],
    animals: [ANIMAL.GOOSE],
    shortDescription: 'Корм для цыплят водоплавающей птицы в период от 0 до 30 дней.',
    fullDescription: 'Корм для цыплят водоплавающей птицы в период от 0 до 30 дней.',
    //gost: 'ГОСТ 26573.0-2017',
    dosing: [
      'Расход корма/гол:',
      'Утки/муларды - 3.0 кг за период.',
      'Гуси - 3.5 кг за период.'
    ],
    enhancements: [],
    indicators: [
      {
        name: 'ПОКАЗАТЕЛИ',
        measurement: `( в кг. )`,
        values: [
          [`СП (мин.) `, `16.0 %`],
          [`ОЭ`, `9,7 МДж`],
          [`Сырая клетчатка (макс.)`, `10.0 %`],
          [`Сырая зола (макс.)`, `8.0 %`],
          [`Сырой жир (макс.) `, `3.0 %`],
        ]
      },
      {
        name: 'МАКРОЭЛЕМЕНТЫ',
        measurement: `( % в кг. )`,
        values: [
          [`Кальций `, `1.0`],
          [`Фосфор`, `0.7`]
        ]
      },
      {
        name: 'ВИТАМИНЫ',
        measurement: `( в кг. )`,
        values: [
          [`Витамин А`, `10 000 ME`],
          [`Витамин D3`, `1 200 ME`],
          [`Витамин E`, `30 мг`]
        ]
      }
    ],
    composition: `Кукуруза, пшеница, шрот соевый, жмых
    рапсовый, кукурузный глютен, рыбная мука, соевое масло, известняковая мука, премикс,
    монокальцийфосфат, соль, аминокислоты.`,
},
{
  code: '015685',
  name: 'UCCELLY',
  type: 'Goose Finish',
  category: CATEGORY.FEED,
  packing: PACKING.BAG,
  weight: '25 кг',
  stages: [STAGE.FINISH],
  animals: [ANIMAL.GOOSE],
  shortDescription: 'Корм для цыплят водоплавающей птицы в период от 31 до 60 дней.',
  fullDescription: 'Корм для цыплят водоплавающей птицы в период от 31 до 60 дней.',
  //gost: 'ГОСТ 26573.0-2017',
  dosing: [
    'Расход корма/гол:',
    'Утки/муларды - 6.0 кг за период.',
    'Гуси - 8.0 кг за период.'
  ],
  enhancements: [],
  indicators: [
    {
      name: 'ПОКАЗАТЕЛИ',
      measurement: `( в кг. )`,
      values: [
        [`СП (мин.) `, `16.0 %`],
        [`ОЭ`, `9,7 МДж`],
        [`Сырая клетчатка (макс.)`, `10.0 %`],
        [`Сырая зола (макс.)`, `8.0 %`],
        [`Сырой жир (макс.) `, `3.0 %`],
      ]
    },
    {
      name: 'МАКРОЭЛЕМЕНТЫ',
      measurement: `( % в кг. )`,
      values: [
        [`Кальций `, `1.0`],
        [`Фосфор`, `0.7`]
      ]
    },
    {
      name: 'ВИТАМИНЫ',
      measurement: `( в кг. )`,
      values: [
        [`Витамин А`, `10 000 ME`],
        [`Витамин D3`, `1 200 ME`],
        [`Витамин E`, `30 мг`]
      ]
    }
  ],
  composition: `Кукуруза, пшеница, шрот соевый, жмых
  рапсовый, мясокостная мука, соевое масло, известняковая мука, премикс,
  монокальцийфосфат, соль, аминокислоты.`,
}] as IProduct[]
